stress-post-api-testing.yml
execution:
- scenario: posts-post-stress
  concurrency: 30
  throughput: 30
  ramp-up: 5m
  hold-for: 1h

scenarios:
  posts-post-stress:
    timeout: 5s
    retrieve-resources: false
    store-cache: false
    store-cookie: false
    default-address: 'http://localhost:3000'
    headers:
      Content-Type: application/json
    requests:
    - url: '/posts'
      method: POST
      headers:
        Content-Type: application/json
      body:
        title: taurus-load
        author: taurus

modules:
  blazemeter:
    token: ?????

reporting:
  - module: blazemeter
    report-name: Posts API stress
    test: Posts API test
    project: QAJungle Tests Group